Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: འཁོར་བ་ནི་འདོད་ཆགས་ཀྱི་མེས་རབ་ཏུ་འབར་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that cyclic existence blazes with the fires of desire;

source: ཞེ་སྡང་གི་མེས་རབ་ཏུ་འབར་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that cyclic existence blazes with the fires of anger;

source: གཏི་མུག་གི་མེས་རབ་ཏུ་དཀྲུགས་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that cyclic existence is a raging fire of dullness;

source: འདུས་བྱས་ནི་མི་རྟག་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that ‘all conditioned things are impermanent’;

source: འདུ་བྱེད་རྣམས་ནི་སྡུག་བསྔལ་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that ‘all formations are painful’;

source: འཇིག་རྟེན་ནི་སྟོང་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that ‘the world is empty’;

source: ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that ‘all phenomena are devoid of self’;

source: འཇིག་རྟེན་ནི་སྤྲོས་པ་ལ་མངོན་པར་དགའ་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that ‘the world is infatuated with constructs’;

source: ཆོས་ཐམས་ཅད་ནི་རྐྱེན་ལས་བྱུང་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that ‘all phenomena arise from conditions’;

source: མྱ་ངན་ལས་འདས་པ་ནི་ཞི་བའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: proper understanding that ‘passing beyond suffering is peace.’

source: དེ་ཡང་ཐོས་པ་དང་། བསམ་པ་དང་། བསྒོམ་པས་ཤེས་ཀྱི་སྒྲར་བརྗོད་པ་ཙམ་གྱིས་མ་ཡིན་ཏེ།
en: Moreover, all these points are comprehended through hearing, contemplating, and training in the teachings. They are not understood merely through words being spoken.

source: དེ་ལྟར་ཤེས་ནས་ཀྱང་སྙིང་རྗེའི་སེམས་བརྟན་པ་ཉེ་བར་བཞག་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་རྩོལ་ཞིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་མོ།
en: Having understood this, they bring forth a steadfast attitude of compassion and diligently strive and endeavor for the sake of sentient beings.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་མང་དུ་ཐོས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities have received abundant teaching.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities uphold the Dharma.

source: ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ལྔ་བརྒྱ་ཐ་མ་ལ་དམ་པའི་ཆོས་རྣམ་པར་འཇིག་ཅིང་བསྟན་པ་འཁྲུགས་པར་གྱུར་པ་དང་། སེམས་ཅན་རྣམས་ལམ་ངན་པར་ཞུགས་པ་དང་། ཡེ་ཤེས་ཀྱི་སྒྲོན་མ་མྱ་ངན་ལས་འདས་ཏེ། སྟོན་པ་མེད་པའི་ཚེ།
en: In the future, during the final five hundred years when the sacred Dharma is destroyed and the teachings disturbed, when sentient beings enter evil ways, when the lamp of wisdom dies out and there is no Teacher

source: མདོ་སྡེ་རྒྱ་ཆེན་པོ། རྒྱ་ཆེན་པོ་དོན་ཆེ་ཞིང་མཐུ་ཆེ་བ། དམ་པའི་ཆོས་ཐམས་ཅད་ཀྱི་མ་མོ་དང་འདྲ་བ་དག་འཛིན་ཅིང་ཀློག་ལ་ཁ་ཏོན་བྱེད་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་།
en: —at that time bodhisattvas will memorize, read, recite, and master the vast discourses, the vast discourses of great meaning and power, and the teachings that are like the mother of all the sacred Dharma.

source: གཞན་དག་ལ་ཡང་རྗོད་ཅིང་སྟོན་ལ་ཡང་དག་པར་སྟོན་ཅིང་གསལ་བར་བྱེད་པ་དང་།
en: They will convey and teach them to others, truly explaining them and elucidating them.

source: དེ་ལ་ཞུགས་པའི་གང་ཟག་རྣམས་ལ་དགའ་བ་དང་། དད་པ་དང་། རངས་པར་བྱེད་ཅིང་དེ་དག་ལ་ཕན་འདོགས་པ་དང་།
en: They will feel happy, faithful, and delighted with those who practice these teachings, and will assist them.

source: ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་དམ་པའི་ཆོས་ཉན་པ་དང་།
en: They will listen to the sacred Dharma without any concern for material things.

source: ཆོས་སྨྲ་བའི་གང་ཟག་རྣམས་ལ་སྟོན་པར་འདུ་ཤེས་སྐྱེད་པ་དང་།
en: They will perceive their Dharma teacher as the Teacher in person.

source: དམ་པའི་ཆོས་ལ་བདུད་རྩིར་འདུ་ཤེས་སྐྱེད་པ་དང་། བཅུད་ཀྱིས་ལེན་དུ་འདུ་ཤེས་སྐྱེད་པ་དང་། རྩིའི་འདུ་ཤེས་སྐྱེད་པ་དང་།
en: They will regard the sacred Dharma as an elixir, ambrosia, and medicine.

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་དམ་པའི་ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་། བཙལ་ནས་ཀྱང་ནན་གྱིས་སྒྲུབ་པའོ།
en: And they will search for the sacred Dharma with no regard for life or limb, and when they find it, they will practice it diligently.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities uphold the Dharma.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྒྱལ་པོའི་སྲས་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are heirs to the King of Dharma.

source: ལུས་མཚན་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་རྣམས་ཡིན།
en: a body adorned with the beautiful marks,

source: ལུས་དཔེ་བྱད་བཟང་པོའི་མེ་ཏོག་རྒྱས་པ་རྣམས་ཡིན།
en: a body blooming with the flowers of the excellent signs,

source: དབང་པོ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་ཞིང་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པ་རྣམས་ཡིན།
en: faculties that are supreme in all aspects and fully perfected,

source: དེ་བཞིན་གཤེགས་པས་བསྟན་པའི་གནས་ལ་རྗེས་སུ་སྟེན་པ་རྣམས་ཡིན།
en: adherence to the points taught by the thus-gone ones,

source: དེ་བཞིན་གཤེགས་པ་རྣམས་བཞུད་པའི་ལམ་རྗེས་སུ་ཐོབ་པར་བྱེད་པ་རྣམས་ཡིན།
en: gaining accomplishment on the path traveled by the thus-gone ones,

source: དེ་བཞིན་གཤེགས་པས་ཐུགས་སུ་ཆུད་པའི་གནས་ཁོང་དུ་ཆུད་པར་བྱེད་པ་རྣམས་ཡིན།
en: gaining comprehension of the points comprehended by the thus-gone ones,

source: འཇིག་རྟེན་སྡུག་བསྔལ་བ་ཡོངས་སུ་སྐྱོང་བ་རྣམས་ཡིན།
en: providing for the suffering world,

source: འཕགས་པའི་ཚུལ་ལ་ཤིན་ཏུ་བསླབས་པ་རྣམས་ཡིན།
en: tremendous training in the way of noble beings,

source: ཚངས་པའི་གནས་རྣམས་ལ་ཤིན་ཏུ་མཐར་ཕྱིན་པ་རྣམས་ཡིན།
en: perfection of the sublime states,

source: དེ་བཞིན་གཤེགས་པ་བཞུགས་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕོ་བྲང་ན་གནས་པ་རྣམས་ཡིན་ཏེ།
en: and rest within the palace of omniscience where the thus-gone ones reside.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་རྒྱལ་པོའི་སྲས་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are heirs to the King of Dharma.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བས་བསྩུ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are welcomed by Śakra, Brahmā, and the guardians of the world.

source: བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་རྣམས་ཡིན།
en: never turning back from awakening,

source: བདུད་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་བ་རྣམས་ཡིན།
en: never being shaken by demons,

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལས་མི་གཡོ་བ་རྣམས་ཡིན།
en: never wavering from any buddha qualities,

source: ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་ཞུགས་པ་རྣམས་ཡིན།
en: being in harmony with the way of all phenomena,

source: ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པ་རྣམས་ཡིན།
en: comprehending the sameness of all phenomena,

source: སངས་རྒྱས་ཀྱི་ཆོས་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་རྣམས་ཡིན།
en: not relying on others with respect to buddha qualities,

source: ཤིན་ཏུ་རྟོགས་པའི་ཡེ་ཤེས་དང་ལྡན་པ་རྣམས་ཡིན།
en: possessing the wisdom of full realization,

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པ་རྣམས་ཡིན།
en: distinction above all hearers and solitary buddhas,

source: འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་རྣམས་ཡིན།
en: superiority above the entire world,

source: མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པ་རྣམས་ཡིན་ནོ།
en: gaining acceptance that phenomena are nonarising.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བས་བསྩུ་བ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are welcomed by Śakra, Brahmā, and the guardians of the world.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་དང་བག་ལ་ཉལ་ཤེས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities know intentions and latent tendencies.

source: སེམས་ཅན་འདོད་ཆགས་ཀྱི་བསམ་པ་ཅན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: correct knowledge of desirous sentient beings,

source: ཞེ་སྡང་གི་བསམ་པ་ཅན་དང་། །གཏི་མུག་གི་བསམ་པ་ཅན་དང་། དམའ་བའི་བསམ་པ་ཅན་དང་། བར་མའི་བསམ་པ་ཅན་དང་། ཞེན་པའི་བསམ་པ་ཅན་དང་། དགེ་བའི་བསམ་པ་ཅན་དང་། བརྟན་པའི་བསམ་པ་ཅན་དང་། ཡུན་རིང་པོའི་བསམ་པ་ཅན་དང་། སེམས་ཅན་གཏུམ་པའི་བསམ་པ་ཅན་དག་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཤིང་།
en: as well as correct knowledge of aggressive, deluded, inferior, middling, attached, virtuous, steadfast, committed, and vicious sentient beings.

source: དེ་ཡང་སེམས་ཅན་གཅིག་ལ་ཇི་ལྟར་ཤེས་པ་བཞིན་དུ་སེམས་ཅན་གྱི་ཁམས་ཀུན་ལ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: Just as they have correct knowledge of one single being, they also have correct knowledge of all realms of beings.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པ་དང་། བག་ལ་ཉལ་ཤེས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities know intentions and latent tendencies.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཆོ་ག་ཤེས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities have knowledge of the ways to bring sentient beings to maturation.

source: སངས་རྒྱས་ཀྱི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་གཟུགས་ཉེ་བར་སྟོན་ཏོ།
en: displaying the form of a buddha to sentient beings who are to be trained by the form of a buddha;

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས།
en: displaying the form of a bodhisattva to sentient beings who are to be trained by the form of a bodhisattva;

source: རང་སངས་རྒྱས་ཀྱི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རང་སངས་རྒྱས་ཀྱི་གཟུགས།
en: displaying the form of a solitary buddha to sentient beings who are to be trained by the form of a solitary buddha;

source: ཉན་ཐོས་ཀྱི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་ཀྱི་གཟུགས།
en: displaying the form of a hearer to sentient beings who are to be trained by the form of a hearer;

source: བརྒྱ་བྱིན་གྱི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བརྒྱ་བྱིན་གྱི་གཟུགས།
en: displaying the form of Śakra to sentient beings who are to be trained by the form of Śakra;

source: བདུད་ཀྱི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བདུད་ཀྱི་གཟུགས།
en: displaying the form of Māra to sentient beings who are to be trained by the form of Māra;

source: ཚངས་པའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཚངས་པའི་གཟུགས།
en: displaying the form of Brahmā to sentient beings who are to be trained by the form of Brahmā;

source: བྲམ་ཟེའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་བྲམ་ཟེའི་གཟུགས།
en: displaying the form of a brahmin to sentient beings who are to be trained by the form of a brahmin;

source: རྒྱལ་རིགས་ཀྱི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་རྒྱལ་རིགས་ཀྱི་གཟུགས།
en: displaying the form of a royal personage to sentient beings who are to be trained by the form of a royal personage;

source: ཁྱིམ་བདག་གི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ཁྱིམ་བདག་གི་གཟུགས་ཉེ་བར་སྟོན་ཏོ།
en: displaying the form of a householder to sentient beings who are to be trained by the form of a householder.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་རྣམ་པ་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་བའི་རྣམ་པ་དེ་དང་དེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཉེ་བར་སྟོན་ཏོ།
en: Thus, noble son, bodhisattvas take on whatever form may be required to train a particular sentient being.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཆོ་ག་ཤེས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities have knowledge of the ways to bring sentient beings to maturation.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དེས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are upright people.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲང་བ་རྣམས་ཡིན། འཇམ་པ་རྣམས་ཡིན། གྱ་གྱུ་མེད་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཡིན། གནོད་སེམས་མེད་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཡིན། དྲི་མ་མེད་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཡིན། རྣམ་པར་དག་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཡིན། མི་བརླང་བའི་སེམས་དང་ལྡན་པ་རྣམས་ཡིན། རྩུབ་པ་སྤངས་པ་རྣམས་ཡིན། བཟོད་པ་མང་བ་རྣམས་ཡིན། དེས་པ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན་ཏེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་དེས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are honesty, gentleness, absence of trickery, absence of ill will, an immaculate mind, a pure mind, absence of abusiveness, absence of viciousness, abundant patience, and perfect decency. Noble son, bodhisattvas who possess ten such qualities are upright people.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འགྲོགས་ན་བདེ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are delightful to accompany.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལྟ་བ་ཡོངས་སུ་དག་པས་ལྟ་བ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན། ཆོ་ག་ཡོངས་སུ་དག་པ་རྣམས་ཡིན། ཚུལ་དང་འཐུན་པའི་སྤྱོད་ཡུལ་དུ་སྤྱོད་པ་རྣམས་ཡིན། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པར་སྤྱོད་པ་རྣམས་ཡིན། ཁོང་ཡངས་པ་རྣམས་ཡིན། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ལ་མཆོད་པ་རྣམས་ཡིན། སྐལ་བ་མཉམ་པ་རྣམས་ཡིན། ལམ་གཅིག་ཏུ་ཞུགས་པ་རྣམས་ཡིན། སྟོན་པ་གཞན་མེད་པ་རྣམས་ཡིན་ནོ། །རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་འགྲོགས་ན་བདེ་བ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are excellent view through the purification of views, excellent discipline, immaculate conduct, keeping proper personal associations, conduct free of affliction, open-mindedness, worship of those who maintain pure conduct, conformity, traveling a single path only, and having no other teachers. Noble son, bodhisattvas who possess ten such qualities are delightful to accompany.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྡུ་བའི་དངོས་པོ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are skilled in the means of attraction.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕན་པའི་སྦྱིན་པས་སེམས་ཅན་རྣམས་སྡུད་དོ། །བདེ་བའི་སྦྱིན་པ་དང་། མི་ཟད་པའི་སྦྱིན་པ་དང་། ཕན་པ་སྨྲ་བ་དང་། དོན་དུ་སྨྲ་བ་དང་། ཆོས་སུ་སྨྲ་བ་དང་། རིགས་པར་སྨྲ་བ་དང་། དོན་བྱ་བ་དང་། ཟང་ཟིང་གིས་དོན་འཐུན་པ་དང་། འཚོ་བའི་ཡོ་བྱད་ཀྱིས་དོན་འཐུན་པས་སེམས་ཅན་རྣམས་སྡུད་དོ།
en: What are those ten? They are to gather sentient beings through giving what is beneficial, giving happiness, giving without end, speaking in beneficial ways, saying what is meaningful, speaking the Dharma, speaking with reason, acting in meaningful ways, creating harmony through material things, and creating harmony by means of their wealth.

source: རིགས་ཀྱི་བུ་ཕན་པའི་སྦྱིན་པ་ནི་གང་ཆོས་སྦྱིན་པའོ།
en: “Noble son, giving what is beneficial is generosity with the Dharma;

source: བདེ་བའི་སྦྱིན་པ་ནི་གང་ཟང་ཟིང་སྦྱིན་པའོ།
en: giving happiness is to give material things;

source: མི་ཟད་པའི་སྦྱིན་པ་ནི་གང་ལམ་གྱི་ལུང་སྦྱིན་པའོ།
en: giving without end concerns instructions about the path;

source: ཕན་པར་སྨྲ་བ་ནི་གང་དགེ་བའི་རྩ་བ་བསྟན་པའོ།
en: speaking in beneficial ways refers to teaching the roots of virtue;

source: དོན་དུ་སྨྲ་བ་ནི་གང་ཡང་དག་པའི་བསྟན་པའོ།
en: saying what is meaningful is the teaching of the truth;

source: ཆོས་སུ་སྨྲ་བ་ནི་གང་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་དང་འཐུན་པར་ཆོས་བསྟན་པའོ།
en: speaking the Dharma is to teach Dharma in accord with the thus-gone ones’ teachings;

source: རིགས་པར་སྨྲ་བ་ནི་གང་དོན་ཡང་དག་པར་ཆུད་མི་གསོན་པའོ།
en: speaking with reason is to ensure that the meaning is not lost;

source: དོན་བྱ་བ་ནི་གང་མི་དགེ་བའི་གནས་ནས་བསླངས་ཏེ་དགེ་བའི་གནས་སུ་གཞོག་པའོ།
en: acting in meaningful ways is to bring beings out of unvirtuous situations and into virtuous ones;

source: ཟང་ཟིང་གིས་དོན་འཐུན་པ་ནི་གང་བཟའ་བ་དང་། བཅའ་བ་དང་། བལྡགས་པ་དང་། བཏུང་བ་དང་། གཞིབ་པ་དང་། གོས་ལ་སོགས་པ་ཐུན་མོང་དུ་ཡོངས་སུ་སྤྱོད་པའོ།
en: creating harmony through material things means to share food, drink, soup, beverages, snacks, clothing, and so on, equally with everyone else.

source: རིགས་ཀྱི་བུ་འཚོ་བའི་ཡོ་བྱད་ཀྱིས་དོན་འཐུན་པ་ནི་གང་གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། ས་ལེ་སྦྲམ་དང་། དངུལ་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟ་དང་། བཞོན་པ་ཐུན་མོང་དུ་སྤྱོད་པ་ཡིན་ནོ།
en: Noble son, creating harmony by means of one’s wealth means to share gold, jewels, pearls, beryl, conchs, crystals, corals, precious metals, silver, horses, elephants, chariots, and carriages equally with everyone else.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྡུ་བའི་དངོས་པོ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are skilled in the means of attraction.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་དུ་ཤིས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are pleasing.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་རྣམས་ཡིན། སྤྱོད་ལམ་སྒྱུ་མེད་པ་རྣམས་ཡིན། སྤྱོད་ལམ་ཡོངས་སུ་དག་པ་རྣམས་ཡིན། བལྟ་ན་དགའ་བ་རྣམས་ཡིན། བལྟ་ན་འཇམ་པ་རྣམས་ཡིན། བལྟ་བས་ཆོག་མི་ཤེས་པ་རྣམས་ཡིན། བལྟ་ན་ཡིད་དུ་འོང་བ་རྣམས་ཡིན། བལྟ་ན་སེམས་ཅན་ཐམས་ཅད་ཁོང་ཁྲོ་བ་མེད་པར་འགྱུར་བ་རྣམས་ཡིན། བལྟ་ན་སེམས་ཅན་ཐམས་ཅད་སེམས་ཚིམ་པར་འགྱུར་བ་རྣམས་ཡིན། བལྟ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་བར་འགྱུར་བ་རྣམས་ཡིན་ཏེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་དུ་ཤིས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are utterly peaceful conduct, conduct without deception, pure conduct, being a joy to behold, providing a gentle sight, providing a sight one never grows tired of, providing a delightful sight, providing a sight that pacifies the anger of all beings, providing a sight that satisfies the minds of all beings, and providing a sight that inspires the minds of all beings. Noble son, bodhisattvas who possess ten such qualities are pleasing.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་གནས་བཅའ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities provide support.

source: སེམས་ཅན་ཐམས་ཅད་ཉོན་མོངས་པའི་འཇིགས་པ་དག་ལས་ཡོངས་སུ་སྲུང་བ་རྣམས་ཡིན།
en: Protecting all sentient beings from the fears of affliction,

source: འཁོར་བའི་འབྲོག་དགོན་པ་ནས་འདོན་པ་རྣམས་ཡིན།
en: delivering them from the wilderness of cyclic existence,

source: འཁོར་བའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བ་རྣམས་ཡིན།
en: taking them across the ocean of cyclic existence,

source: མགོན་མེད་པ་རྣམས་ལ་གཉེན་དུ་གྱུར་པ་རྣམས་ཡིན།
en: being the guardian of those without a protector,

source: ཉོན་མོངས་པའི་ནད་ཀྱིས་ནད་པར་གྱུར་པ་རྣམས་ལ་སྨན་པར་གྱུར་པ་རྣམས་ཡིན།
en: being the doctor for those stricken by the diseases of affliction,

source: རྟེན་མེད་པ་དག་ལ་རྟེན་པ་རྣམས་ཡིན།
en: providing a basis for those who have none,

source: གནས་མེད་པ་དག་ལ་གནས་པ་རྣམས་ཡིན།
en: providing a support for those who have none,

source: སྐྱབས་མེད་པ་དག་ལ་སྐྱབས་རྣམས་ཡིན།
en: being the savior of those who have none,

source: གླིང་མེད་པ་དག་ལ་གླིང་རྣམས་ཡིན།
en: being the refuge for those who have none,

source: དཔུང་གཉེན་མེད་པ་དག་ལ་དཔུང་གཉེན་རྣམས་ཡིན་ཏེ།
en: being the defender of those who have none.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་གནས་བཅའ་བ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities provide support.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྩིའི་རྒྱལ་པོའི་ཤིང་ཆེན་པོ་ལྟ་བུ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities are like the king of medicinal trees.

source: དཔེར་ན་རྩིའི་རྒྱལ་པོའི་ཤིང་ཆེན་པོ་བལྟ་ན་བཟང་བ་ཞེས་བྱ་བ་དེ་ནི་རྩ་བས་ཀྱང་སེམས་ཅན་ནད་པ་རྣམས་ཉེ་བར་འཚོའོ།
en: Consider the analogy of the king of medicinal trees known as Excellent to Behold.

source: སྡོང་པོ་དང་། ཡལ་ག་རྣམས་དང་། ལོ་མ་རྣམས་དང་། མེ་ཏོག་རྣམས་དང་། འབྲས་བུ་རྣམས་དང་། མཐོང་བ་དང་། མནམས་པ་དང་། མྱངས་པ་དང་། རེག་པས་ཀྱང་ཉེ་བར་འཚོ་བ་ཡིན་ཏེ།
en: Even the roots of this tree are healing to sentient beings and so are its trunk, branches, leaves, flowers, and fruits. Seeing, grasping, tasting, and touching this tree are likewise healing.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ།
en: Noble son, similarly, from the point at which bodhisattvas first give rise to the mind of awakening,

source: ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱི་ནད་ཀྱིས་ནད་པར་གྱུར་པའི་སེམས་ཅན་རྣམས་སྦྱིན་པས་ཀྱང་ཉེ་བར་འཚོ་བ་ཡིན། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། མཐོང་བ་དང་། ཐོས་པ་དང་། ཡོན་ཏན་གྱི་རོ་མྱངས་པ་དང་། བསྙེན་བཀུར་བྱས་པས་ཀྱང་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: they heal sentient beings through their generosity, discipline, patience, diligence, concentration, and insight. Moreover, sentient beings are also healed by seeing and hearing bodhisattvas, by getting a taste of their qualities, and by venerating them.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རྩིའི་རྒྱལ་པོའི་ཤིང་ཆེན་པོ་ལྟ་བུ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities are like the king of medicinal trees.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་བྱ་བ་ལ་བརྩོན་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities pursue virtuous deeds.

source: དཀོན་མཆོག་གསུམ་ལ་ཅི་ནུས་སུ་བྱ་བ་བྱེད་པ་དང་།
en: They serve the Three Jewels by all means possible.

source: སེམས་ཅན་ནད་པ་རྣམས་ལ་རྩི་སྦྱོར་བ་དང་། སེམས་ཅན་བཀྲེས་པ་དང་སྐོམ་པས་ཉེན་པ་རྣམས་ལ་ཟས་དང་སྐོམ་གྱི་སྦྱིན་པ་དང་། རླུང་དང་ལྷགས་པ་དང་ཉི་མས་ཉེན་པའི་སེམས་ཅན་རྣམས་ལ་དགབ་པ་སྦྱིན་པ་དང་།
en: They provide medicine to the ill, food and drink to those suffering from starvation and thirst, and a shelter for those who are exposed to winds, storms, and the sun.

source: མཁན་པོ་དང་། སློབ་དཔོན་རྣམས་ལ་གུས་པར་རིམ་གྲོ་བྱེད་པ་དང་། ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་གུས་པར་སྨྲ།
en: They respectfully venerate preceptors and masters and speak respectfully to those who maintain pure conduct.

source: ཕྱག་འཚལ། ལྡང་ཐལ་མོ་སྦྱར་ཞིང་འདུད་པར་བྱེད་པ་དང་།
en: With veneration, they prostrate and join their palms before them.

source: ཀུན་དགའ་ར་བ་དང་། གཙུག་ལག་ཁང་དང་། སྐྱེད་མོས་ཚལ་བྱ་བ་དང་། དུས་དུས་སུ་ནོར་དང་། འབྲུ་དང་། མཛོད་དང་།
en: They offer them gardens, temples, and parks, as well as, in a timely manner, wealth, grains, treasuries, and storehouses.

source: བང་བ་གཏོང་བ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་མི་དང་། ཞོ་ཤས་འཚོ་བ་ལ་བགོ་བཤས་ཡོངས་སུ་སྐྱོང་བ་དང་།
en: They see to it that they have servants, personnel, and workers as needed.

source: དུས་དུས་སུ་ཚུལ་ཁྲིམས་དང་ལྡན་པའི་དགེ་སྦྱོང་དང་བྲམ་ཟེ་དག་ལ་བསྙེན་བཀུར་བྱེད་པའོ།
en: In a timely manner, they pay respect to disciplined mendicants and brahmins.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་བྱ་བ་ལ་བརྩོན་པ་རྣམས་ཡིན་ནོ།
en: Noble son, bodhisattvas who possess ten such qualities pursue virtuous deeds.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་སྤྲུལ་པ་ལ་མཁས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas endowed with ten qualities have expertise regarding emanations.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡོངས་སུ་འདྲིའོ།
en: Without moving from one given buddha realm, they pose questions to the thus-gone ones in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཆོས་ཉན་ཏོ།
en: Without moving from one given buddha realm, they listen to the Dharma from the thus-gone ones in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་ཅིང་བསྙེན་བཀུར་བྱེད་དོ།
en: Without moving from one given buddha realm, they worship and venerate the thus-gone ones in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Without moving from one given buddha realm, they perfect the accumulations for awakening in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་རྣམས་ལ་རིམ་གྲོ་བྱེད། བཀུར་སྟི་བྱེད། བསྟི་སྟང་བྱེད། མཆོད་པ་བྱེད་དོ།
en: Without moving from one given buddha realm, they venerate, respect, revere, and worship bodhisattvas who are awakening to complete buddhahood in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་སྟོན་ཏོ།
en: Without moving from one given buddha realm, they show going to the seat of awakening in numerous buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ནས་ཀྱང་མི་གཡོ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་མར་ཡང་བདག་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་སྣང་ངོ་།
en: Without moving from one given buddha realm, they appear to awaken to complete buddhahood in numerous buddha realms.
